Terraform plan for __production__
<details>
<summary>Plan: 2 to add, 1 to change, 3 to destroy.</summary>

```hcl
Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  ~ update in-place
  - destroy
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # aws_iam_user_policy_attachment.eks_broker_policies["arn:aws:iam::821341638715:policy/eks_brokerpak_pv_policy"] will be destroyed
  # (because key ["arn:aws:iam::821341638715:policy/eks_brokerpak_pv_policy"] is not in for_each map)
  - resource "aws_iam_user_policy_attachment" "eks_broker_policies" {
      - id         = "ssb-eks-broker-20220209185044831600000001" -> null
      - policy_arn = "arn:aws:iam::821341638715:policy/eks_brokerpak_pv_policy" -> null
      - user       = "ssb-eks-broker" -> null
    }

  # aws_iam_user_policy_attachment.eks_broker_policies["arn:aws:iam::aws:policy/AmazonS3FullAccess"] will be created
  + resource "aws_iam_user_policy_attachment" "eks_broker_policies" {
      + id         = (known after apply)
      + policy_arn = "arn:aws:iam::aws:policy/AmazonS3FullAccess"
      + user       = "ssb-eks-broker"
    }

  # module.broker_solrcloud.cloudfoundry_app.ssb will be updated in-place
  ~ resource "cloudfoundry_app" "ssb" {
        id                         = "8aad564a-c19c-4769-9eee-56ac7f1c0dd4"
      ~ id_bg                      = "************************************" -> (known after apply)
        name                       = "ssb-solrcloud"
        # (21 unchanged attributes hidden)


      + service_binding {
          + service_instance = "a2ae6fac-d1ff-4f0f-be87-39f066c632f1"
        }
        # (2 unchanged blocks hidden)
    }

  # module.eks_brokerpak_policy.aws_iam_policy.policy must be replaced
-/+ resource "aws_iam_policy" "policy" {
      ~ arn         = "arn:aws:iam::821341638715:policy/eks_brokerpak_policy" -> (known after apply)
      ~ description = "Policy granting additional permissions needed by the EKS brokerpak" -> "Policy granting additional permissions needed by the EKS brokerpak; most are for managing PVs" # forces replacement
      ~ id          = "*****************************************************" -> (known after apply)
        name        = "eks_brokerpak_policy"
      ~ policy      = jsonencode(
          ~ {
              ~ Statement = [
                  ~ {
                      ~ Action   = [
                            # (11 unchanged elements hidden)
                            "eks:UpdateNodegroupVersion",
                          + "iam:CreateUser",
                          + "iam:DeleteUser",
                          + "iam:GetUser",
                          + "iam:UpdateUser",
                          + "iam:CreateAccessKey",
                          + "iam:DeleteAccessKey",
                          + "iam:PutUserPolicy",
                          + "iam:GetUserPolicy",
                          + "iam:DeleteUserPolicy",
                          + "iam:TagUser",
                          + "iam:UntagUser",
                        ]
                        # (2 unchanged elements hidden)
                    },
                  + {
                      + Action   = [
                          + "ec2:CreateSnapshot",
                          + "ec2:AttachVolume",
                          + "ec2:DetachVolume",
                          + "ec2:ModifyVolume",
                          + "ec2:DescribeAvailabilityZones",
                          + "ec2:DescribeInstances",
                          + "ec2:DescribeSnapshots",
                          + "ec2:DescribeTags",
                          + "ec2:DescribeVolumes",
                          + "ec2:DescribeVolumesModifications",
                        ]
                      + Effect   = "Allow"
                      + Resource = "*"
                    },
                  + {
                      + Action    = [
                          + "ec2:CreateTags",
                        ]
                      + Condition = {
                          + StringEquals = {
                              + "ec2:CreateAction" = [
                                  + "CreateVolume",
                                  + "CreateSnapshot",
                                ]
                            }
                        }
                      + Effect    = "Allow"
                      + Resource  = [
                          + "arn:aws:ec2:*:*:volume/*",
                          + "arn:aws:ec2:*:*:snapshot/*",
                        ]
                    },
                  + {
                      + Action   = [
                          + "ec2:DeleteTags",
                        ]
                      + Effect   = "Allow"
                      + Resource = [
                          + "arn:aws:ec2:*:*:volume/*",
                          + "arn:aws:ec2:*:*:snapshot/*",
                        ]
                    },
                  + {
                      + Action    = [
                          + "ec2:CreateVolume",
                        ]
                      + Condition = {
                          + StringLike = {
                              + "aws:RequestTag/ebs.csi.aws.com/cluster" = "true"
                            }
                        }
                      + Effect    = "Allow"
                      + Resource  = "*"
                    },
                  + {
                      + Action    = [
                          + "ec2:CreateVolume",
                        ]
                      + Condition = {
                          + StringLike = {
                              + "aws:RequestTag/CSIVolumeName" = "*"
                            }
                        }
                      + Effect    = "Allow"
                      + Resource  = "*"
                    },
                  + {
                      + Action    = [
                          + "ec2:CreateVolume",
                        ]
                      + Condition = {
                          + StringLike = {
                              + "aws:RequestTag/kubernetes.io/cluster/*" = "owned"
                            }
                        }
                      + Effect    = "Allow"
                      + Resource  = "*"
                    },
                  + {
                      + Action    = [
                          + "ec2:DeleteVolume",
                        ]
                      + Condition = {
                          + StringLike = {
                              + "ec2:ResourceTag/ebs.csi.aws.com/cluster" = "true"
                            }
                        }
                      + Effect    = "Allow"
                      + Resource  = "*"
                    },
                  + {
                      + Action    = [
                          + "ec2:DeleteVolume",
                        ]
                      + Condition = {
                          + StringLike = {
                              + "ec2:ResourceTag/CSIVolumeName" = "*"
                            }
                        }
                      + Effect    = "Allow"
                      + Resource  = "*"
                    },
                  + {
                      + Action    = [
                          + "ec2:DeleteVolume",
                        ]
                      + Condition = {
                          + StringLike = {
                              + "ec2:ResourceTag/kubernetes.io/cluster/*" = "owned"
                            }
                        }
                      + Effect    = "Allow"
                      + Resource  = "*"
                    },
                  + {
                      + Action    = [
                          + "ec2:DeleteSnapshot",
                        ]
                      + Condition = {
                          + StringLike = {
                              + "ec2:ResourceTag/CSIVolumeSnapshotName" = "*"
                            }
                        }
                      + Effect    = "Allow"
                      + Resource  = "*"
                    },
                  + {
                      + Action    = [
                          + "ec2:DeleteSnapshot",
                        ]
                      + Condition = {
                          + StringLike = {
                              + "ec2:ResourceTag/ebs.csi.aws.com/cluster" = "true"
                            }
                        }
                      + Effect    = "Allow"
                      + Resource  = "*"
                    },
                ]
                # (1 unchanged element hidden)
            }
        )
      ~ policy_id   = "*********************" -> (known after apply)
      - tags        = {} -> null
      ~ tags_all    = {} -> (known after apply)
        # (1 unchanged attribute hidden)
    }

  # module.eks_brokerpak_pv_policy.aws_iam_policy.policy will be destroyed
  # (because aws_iam_policy.policy is not in configuration)
  - resource "aws_iam_policy" "policy" {
      - arn         = "arn:aws:iam::821341638715:policy/eks_brokerpak_pv_policy" -> null
      - description = "Policy granting additional permissions needed by the EKS brokerpak for Persistent Volumes" -> null
      - id          = "arn:aws:iam::821341638715:policy/eks_brokerpak_pv_policy" -> null
      - name        = "eks_brokerpak_pv_policy" -> null
      - path        = "/" -> null
      - policy      = jsonencode(
            {
              - Statement = [
                  - {
                      - Action   = [
                          - "ec2:CreateSnapshot",
                          - "ec2:AttachVolume",
                          - "ec2:DetachVolume",
                          - "ec2:ModifyVolume",
                          - "ec2:DescribeAvailabilityZones",
                          - "ec2:DescribeInstances",
                          - "ec2:DescribeSnapshots",
                          - "ec2:DescribeTags",
                          - "ec2:DescribeVolumes",
                          - "ec2:DescribeVolumesModifications",
                        ]
                      - Effect   = "Allow"
                      - Resource = "*"
                    },
                  - {
                      - Action    = [
                          - "ec2:CreateTags",
                        ]
                      - Condition = {
                          - StringEquals = {
                              - "ec2:CreateAction" = [
                                  - "CreateVolume",
                                  - "CreateSnapshot",
                                ]
                            }
                        }
                      - Effect    = "Allow"
                      - Resource  = [
                          - "arn:aws:ec2:*:*:volume/*",
                          - "arn:aws:ec2:*:*:snapshot/*",
                        ]
                    },
                  - {
                      - Action   = [
                          - "ec2:DeleteTags",
                        ]
                      - Effect   = "Allow"
                      - Resource = [
                          - "arn:aws:ec2:*:*:volume/*",
                          - "arn:aws:ec2:*:*:snapshot/*",
                        ]
                    },
                  - {
                      - Action    = [
                          - "ec2:CreateVolume",
                        ]
                      - Condition = {
                          - StringLike = {
                              - "aws:RequestTag/ebs.csi.aws.com/cluster" = "true"
                            }
                        }
                      - Effect    = "Allow"
                      - Resource  = "*"
                    },
                  - {
                      - Action    = [
                          - "ec2:CreateVolume",
                        ]
                      - Condition = {
                          - StringLike = {
                              - "aws:RequestTag/CSIVolumeName" = "*"
                            }
                        }
                      - Effect    = "Allow"
                      - Resource  = "*"
                    },
                  - {
                      - Action    = [
                          - "ec2:CreateVolume",
                        ]
                      - Condition = {
                          - StringLike = {
                              - "aws:RequestTag/kubernetes.io/cluster/*" = "owned"
                            }
                        }
                      - Effect    = "Allow"
                      - Resource  = "*"
                    },
                  - {
                      - Action    = [
                          - "ec2:DeleteVolume",
                        ]
                      - Condition = {
                          - StringLike = {
                              - "ec2:ResourceTag/ebs.csi.aws.com/cluster" = "true"
                            }
                        }
                      - Effect    = "Allow"
                      - Resource  = "*"
                    },
                  - {
                      - Action    = [
                          - "ec2:DeleteVolume",
                        ]
                      - Condition = {
                          - StringLike = {
                              - "ec2:ResourceTag/CSIVolumeName" = "*"
                            }
                        }
                      - Effect    = "Allow"
                      - Resource  = "*"
                    },
                  - {
                      - Action    = [
                          - "ec2:DeleteVolume",
                        ]
                      - Condition = {
                          - StringLike = {
                              - "ec2:ResourceTag/kubernetes.io/cluster/*" = "owned"
                            }
                        }
                      - Effect    = "Allow"
                      - Resource  = "*"
                    },
                  - {
                      - Action    = [
                          - "ec2:DeleteSnapshot",
                        ]
                      - Condition = {
                          - StringLike = {
                              - "ec2:ResourceTag/CSIVolumeSnapshotName" = "*"
                            }
                        }
                      - Effect    = "Allow"
                      - Resource  = "*"
                    },
                  - {
                      - Action    = [
                          - "ec2:DeleteSnapshot",
                        ]
                      - Condition = {
                          - StringLike = {
                              - "ec2:ResourceTag/ebs.csi.aws.com/cluster" = "true"
                            }
                        }
                      - Effect    = "Allow"
                      - Resource  = "*"
                    },
                ]
              - Version   = "2012-10-17"
            }
        ) -> null
      - policy_id   = "ANPA36O6G2A56S5PO7TGL" -> null
      - tags        = {} -> null
      - tags_all    = {} -> null
    }

Plan: 2 to add, 1 to change, 3 to destroy.
```
</details>

:memo: Plan generated in [plan #218](https://github.com/GSA/datagov-ssb/actions/runs/2182535982)